# 新手教程—Pandas库使用示例

以下内容是对pandas库的简要介绍，主要面向新用户，您可以访问http://pandas.pydata.org/pandas-docs/dev/10min.html 查看更多示例，如果您想更深入的学习pandas，推荐您查看《利用Python进行数据分析》一书。

In [1]:
#导入常用libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# import package_name
# import package_name as alias_name
# import package_name.module_name as alias_name

pd.options.display.max_rows = 31

C:\Users\Jinze Wang\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:61: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

## 数据读取

In [2]:
# read data
# read from file 
df1 = pd.read_csv('data/data1.csv')
df1 = pd.read_excel('data/data1.xlsx')

# read from url
df2 = pd.read_html('https://www.xxx.com')

# read from database
# conn is the connection to the database
df3 = pd.read_sql('select * from table', conn)

# SQL -- Structured Query Language

FileNotFoundError: [Errno 2] No such file or directory: 'data/data1.csv'

## 数据结构

Pandas最重要的数据结构有Series和DataFrame，这里介绍series一些基本操作。

创建一个Series

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

创建一个DataFrame，包括一个numpy array, 时间索引和列名字。

In [ ]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.923998  1.839845 -1.309419  0.864538
2013-01-02  0.153757  0.139857  0.974259  1.292454
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240
2013-01-05  1.858534 -0.303052  0.002442 -0.998021
2013-01-06 -0.634888 -0.939908 -1.689156 -0.836025

创建一个DataFrame，包括一个可以转化为Series的字典

In [ ]:
df2 = pd.DataFrame({ 'A' : 1.,
              'B' : pd.Timestamp('20130102'),
              'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
               'D' : np.array([3] * 4,dtype='int32'),
               'E' : pd.Categorical(["test","train","test","train"]),
               'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

可以完成自动补全功能，下面这是一个例子。

df2.A                  df2.boxplot
df2.abs                df2.C
df2.add                df2.clip
df2.add_prefix         df2.clip_lower
df2.add_suffix         df2.clip_upper
df2.align              df2.columns
df2.all                df2.combine
df2.any                df2.combineAdd
df2.append             df2.combine_first
df2.apply              df2.combineMult
df2.applymap           df2.compound
df2.as_blocks          df2.consolidate
df2.asfreq             df2.convert_objects
df2.as_matrix          df2.copy
df2.astype             df2.corr
df2.at                 df2.corrwith
df2.at_time            df2.count
df2.axes               df2.cov
df2.B                  df2.cummax
df2.between_time       df2.cummin
df2.bfill              df2.cumprod
df2.blocks             df2.cumsum
df2.bool               df2.D

## 查看数据

查看前几条数据

In [ ]:
df.head(2)

                   A         B         C         D
2013-01-01  1.923998  1.839845 -1.309419  0.864538
2013-01-02  0.153757  0.139857  0.974259  1.292454

查看后几条数据

In [ ]:
df.tail()

                   A         B         C         D
2013-01-02  0.153757  0.139857  0.974259  1.292454
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240
2013-01-05  1.858534 -0.303052  0.002442 -0.998021
2013-01-06 -0.634888 -0.939908 -1.689156 -0.836025

In [ ]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [ ]:
df.values

array([[-1.29015182, -1.28471056,  0.30586477,  0.25301148],
       [ 0.19073027, -0.01615997, -1.40120364, -0.76394756],
       [-1.02616218,  0.4632713 , -1.50603104,  0.34604083],
       [-0.19879867, -0.27569276,  0.0067706 , -0.10310623],
       [ 0.63047865, -0.17466972, -1.93837179,  0.61205612],
       [ 1.34104377,  3.61436276,  1.70687769,  0.33406853]])

In [ ]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.380994  0.263915 -0.552284  0.129649
std    1.226017  0.979836  0.951430  1.013070
min   -0.887411 -0.939908 -1.689156 -0.998021
25%   -0.508173 -0.243914 -1.155762 -0.748342
50%    0.012866  0.036679 -0.645914  0.189622
75%    1.432340  0.719898 -0.147427  0.921314
max    1.923998  1.839845  0.974259  1.292454

In [ ]:
df.T
# transpose

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.290152    0.190730   -1.026162   -0.198799    0.630479    1.341044
B   -1.284711   -0.016160    0.463271   -0.275693   -0.174670    3.614363
C    0.305865   -1.401204   -1.506031    0.006771   -1.938372    1.706878
D    0.253011   -0.763948    0.346041   -0.103106    0.612056    0.334069

## 选择数据

In [ ]:
df['A']

2013-01-01    1.923998
2013-01-02    0.153757
2013-01-03   -0.887411
2013-01-04   -0.128025
2013-01-05    1.858534
2013-01-06   -0.634888
Freq: D, Name: A, dtype: float64

In [ ]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.290152 -1.284711  0.305865  0.253011
2013-01-02  0.190730 -0.016160 -1.401204 -0.763948
2013-01-03 -1.026162  0.463271 -1.506031  0.346041

In [ ]:
df['20130104':'20130106']

                   A         B         C         D
2013-01-04 -0.198799 -0.275693  0.006771 -0.103106
2013-01-05  0.630479 -0.174670 -1.938372  0.612056
2013-01-06  1.341044  3.614363  1.706878  0.334069

In [ ]:
df.loc[dates[0]]

A    1.923998
B    1.839845
C   -1.309419
D    0.864538
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.290152 -1.284711
2013-01-02  0.190730 -0.016160
2013-01-03 -1.026162  0.463271
2013-01-04 -0.198799 -0.275693
2013-01-05  0.630479 -0.174670
2013-01-06  1.341044  3.614363

In [ ]:
df.loc['20130101':'20130103','A':'B']

                   A         B
2013-01-01 -1.290152 -1.284711
2013-01-02  0.190730 -0.016160
2013-01-03 -1.026162  0.463271

In [ ]:
df.loc['20130101','A':'B']

A   -1.290152
B   -1.284711
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
df.loc[dates[0],'A']

-1.2901518173417785

In [ ]:
df.at[dates[0],'A']

-1.2901518173417785

In [ ]:
df.iloc[3]

A   -0.198799
B   -0.275693
C    0.006771
D   -0.103106
Name: 2013-01-04 00:00:00, dtype: float64

In [ ]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.198799 -0.275693
2013-01-05  0.630479 -0.174670

In [ ]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.190730 -1.401204
2013-01-03 -1.026162 -1.506031
2013-01-05  0.630479 -1.938372

In [ ]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.190730 -0.016160 -1.401204 -0.763948
2013-01-03 -1.026162  0.463271 -1.506031  0.346041

In [ ]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.284711  0.305865
2013-01-02 -0.016160 -1.401204
2013-01-03  0.463271 -1.506031
2013-01-04 -0.275693  0.006771
2013-01-05 -0.174670 -1.938372
2013-01-06  3.614363  1.706878

In [ ]:
df.iloc[1,1]

-0.016159972797852588

### filter data 筛选数据

In [ ]:
df['A']

2013-01-01    1.923998
2013-01-02    0.153757
2013-01-03   -0.887411
2013-01-04   -0.128025
2013-01-05    1.858534
2013-01-06   -0.634888
Freq: D, Name: A, dtype: float64

In [ ]:
df['A'] > 0

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [ ]:
df[df['A'] > -1]

                   A         B         C         D
2013-01-01  1.923998  1.839845 -1.309419  0.864538
2013-01-02  0.153757  0.139857  0.974259  1.292454
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240
2013-01-05  1.858534 -0.303052  0.002442 -0.998021
2013-01-06 -0.634888 -0.939908 -1.689156 -0.836025

In [ ]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.305865  0.253011
2013-01-02  0.190730       NaN       NaN       NaN
2013-01-03       NaN  0.463271       NaN  0.346041
2013-01-04       NaN       NaN  0.006771       NaN
2013-01-05  0.630479       NaN       NaN  0.612056
2013-01-06  1.341044  3.614363  1.706878  0.334069

In [ ]:
df2=df.copy()
# create a new column
df2['E']=['one', 'one','two','three','four','three']

df2

                   A         B         C         D      E
2013-01-01  1.923998  1.839845 -1.309419  0.864538    one
2013-01-02  0.153757  0.139857  0.974259  1.292454    one
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293    two
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  three
2013-01-05  1.858534 -0.303052  0.002442 -0.998021   four
2013-01-06 -0.634888 -0.939908 -1.689156 -0.836025  three

In [ ]:
df2['F']=df2['A']+df2['B']
df2

                   A         B         C         D      E         F
2013-01-01  1.923998  1.839845 -1.309419  0.864538    one  3.763843
2013-01-02  0.153757  0.139857  0.974259  1.292454    one  0.293614
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293    two  0.025834
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  three -0.194525
2013-01-05  1.858534 -0.303052  0.002442 -0.998021   four  1.555482
2013-01-06 -0.634888 -0.939908 -1.689156 -0.836025  three -1.574797

In [ ]:
df2['G'] = 0
df2

                   A         B         C         D      E         F  G
2013-01-01  1.923998  1.839845 -1.309419  0.864538    one  3.763843  0
2013-01-02  0.153757  0.139857  0.974259  1.292454    one  0.293614  0
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293    two  0.025834  0
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  three -0.194525  0
2013-01-05  1.858534 -0.303052  0.002442 -0.998021   four  1.555482  0
2013-01-06 -0.634888 -0.939908 -1.689156 -0.836025  three -1.574797  0

In [ ]:
df2['E'].isin(['one'])

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [ ]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.026162  0.463271 -1.506031  0.346041   two
2013-01-05  0.630479 -0.174670 -1.938372  0.612056  four

In [ ]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [ ]:
df['F'] = s1

In [ ]:
df.at[dates[0],'A'] = 0

In [ ]:
df.iat[0,1] = 0

In [ ]:
df.loc[:,'D'] = np.array([5] * len(df))

In [ ]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.305865  5  NaN
2013-01-02  0.190730 -0.016160 -1.401204  5  1.0
2013-01-03 -1.026162  0.463271 -1.506031  5  2.0
2013-01-04 -0.198799 -0.275693  0.006771  5  3.0
2013-01-05  0.630479 -0.174670 -1.938372  5  4.0
2013-01-06  1.341044  3.614363  1.706878  5  5.0

In [ ]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.305865 -5  NaN
2013-01-02 -0.190730 -0.016160 -1.401204 -5 -1.0
2013-01-03 -1.026162 -0.463271 -1.506031 -5 -2.0
2013-01-04 -0.198799 -0.275693 -0.006771 -5 -3.0
2013-01-05 -0.630479 -0.174670 -1.938372 -5 -4.0
2013-01-06 -1.341044 -3.614363 -1.706878 -5 -5.0

## 缺失数据

缺失数据使用np.nan表示，默认不包括在计算内，可以通过下列方法更改缺失数据。

In [ ]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1],'E'] = 1

df1

                   A         B         C         D    E
2013-01-01  1.923998  1.839845 -1.309419  0.864538  1.0
2013-01-02  0.153757  0.139857  0.974259  1.292454  1.0
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293  NaN
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  NaN

In [ ]:
# 删除空值
df1.dropna(subset=['E'])

                   A         B         C         D    E
2013-01-01  1.923998  1.839845 -1.309419  0.864538  1.0
2013-01-02  0.153757  0.139857  0.974259  1.292454  1.0

In [ ]:
# 填充空值
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  1.923998  1.839845 -1.309419  0.864538  1.0
2013-01-02  0.153757  0.139857  0.974259  1.292454  1.0
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293  5.0
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  5.0

In [ ]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

## 统计

In [ ]:
df.mean()#列计算

A    0.380994
B    0.263915
C   -0.552284
D    0.129649
dtype: float64

In [ ]:
df.mean(1)#行计算

2013-01-01    0.829741
2013-01-02    0.640082
2013-01-03   -0.288563
2013-01-04    0.037170
2013-01-05    0.139976
2013-01-06   -1.024994
Freq: D, dtype: float64

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates)#.shift(2)

s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [ ]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.026162 -0.536729 -2.506031  4.0  1.0
2013-01-04 -3.198799 -3.275693 -2.993229  2.0  0.0
2013-01-05 -4.369521 -5.174670 -6.938372  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [ ]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.305865  5  NaN
2013-01-02  0.190730 -0.016160 -1.401204  5  1.0
2013-01-03 -1.026162  0.463271 -1.506031  5  2.0
2013-01-04 -0.198799 -0.275693  0.006771  5  3.0
2013-01-05  0.630479 -0.174670 -1.938372  5  4.0
2013-01-06  1.341044  3.614363  1.706878  5  5.0

In [ ]:
# mean, max, min, sum, std, var, median, mode
df.max()

A    1.923998
B    1.839845
C    0.974259
D    1.292454
dtype: float64

### ***APPLY

In [ ]:
df1

                   A         B         C         D    E
2013-01-01  1.923998  1.839845 -1.309419  0.864538  1.0
2013-01-02  0.153757  0.139857  0.974259  1.292454  1.0
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293  NaN
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  NaN

In [ ]:
def my_func(x):
    if x>1:
        return 'high'
    else:
        return 'low'

In [ ]:
df1['B_size_1'] = df1['B'].apply(lambda x: my_func(x))
df1

,A,B,C,D,E,B_size,sum,B_size_1
2013-01-01,1.923998,1.839845,-1.309419,0.864538,1.0,high,3.318962,high
2013-01-02,0.153757,0.139857,0.974259,1.292454,1.0,low,2.560327,low
2013-01-03,-0.887411,0.913245,-0.694792,-0.485293,NaN,low,-1.154252,low
2013-01-04,-0.128025,-0.066499,-0.597035,0.940240,NaN,low,0.148680,low

In [ ]:
df1['B_size'] = df1['B'].apply(lambda x: 'high' if x > 1 else 'low')
df1

                   A         B         C         D    E B_size
2013-01-01  1.923998  1.839845 -1.309419  0.864538  1.0   high
2013-01-02  0.153757  0.139857  0.974259  1.292454  1.0    low
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293  NaN    low
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  NaN    low

In [ ]:
df1['sum'] = df1[['A','B','C','D']].apply(lambda x: np.sum(x), axis=1)
df1

                   A         B         C         D    E B_size       sum
2013-01-01  1.923998  1.839845 -1.309419  0.864538  1.0   high  3.318962
2013-01-02  0.153757  0.139857  0.974259  1.292454  1.0    low  2.560327
2013-01-03 -0.887411  0.913245 -0.694792 -0.485293  NaN    low -1.154252
2013-01-04 -0.128025 -0.066499 -0.597035  0.940240  NaN    low  0.148680

In [ ]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.305865   5   NaN
2013-01-02  0.190730 -0.016160 -1.095339  10   1.0
2013-01-03 -0.835432  0.447111 -2.601370  15   3.0
2013-01-04 -1.034231  0.171419 -2.594599  20   6.0
2013-01-05 -0.403752 -0.003251 -4.532971  25  10.0
2013-01-06  0.937292  3.611112 -2.826093  30  15.0

In [ ]:
df.apply(lambda x: x.max() - x.min())

A    2.367206
B    3.890056
C    3.645249
D    0.000000
F    4.000000
dtype: float64

In [ ]:
s = pd.Series(np.random.randint(0,7,size=10))

s

0    5
1    2
2    5
3    0
4    5
5    3
6    0
7    6
8    2
9    0
dtype: int64

In [ ]:
s.value_counts()#统计频率

5    3
0    3
2    2
6    1
3    1
dtype: int64

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## 规整 Merge

### concat

In [ ]:
df_salary = pd.DataFrame({'person id': [1,1, 2, 8, 9, 5], 'salary': [100000,12, 200000, 300000, 400000, 500000], 'department': ['HR','JY', 'IT', 'Finance', 'Marketing', 'Sales']})
df1= df_salary[:3]
df2 = df_salary[3:]

In [ ]:
df1

   person id  salary department
0          1  100000         HR
1          1      12         JY
2          2  200000         IT

In [ ]:
df2

   person id  salary department
3          8  300000    Finance
4          9  400000  Marketing
5          5  500000      Sales

In [ ]:
pd.merge(df1,df2,on=['person id','salary','department'],how='outer')

   person id  salary department
0          1      12         JY
1          1  100000         HR
2          2  200000         IT
3          5  500000      Sales
4          8  300000    Finance
5          9  400000  Marketing

In [ ]:
# break it into pieces
pd.concat([df1,df2])

   person id  salary department
0          1  100000         HR
1          1      12         JY
2          2  200000         IT
3          8  300000    Finance
4          9  400000  Marketing
5          5  500000      Sales

### merge

In [ ]:
# join multiple tables

# left join

# right join

# inner join

# outer join

SyntaxError: invalid syntax (1584363653.py, line 1)

In [ ]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [ ]:
# create a dataframe for person id, name, age, gender, city
df_person = pd.DataFrame({'person id': [1, 7, 3, 4, 5], 'name': ['John', 'Jane', 'Jim', 'Jill', 'Jack'], 'age': [25, 30, 35, 40, 45], 'gender': ['M', 'F', 'M', 'F', 'M'], 'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']})
# create another dataframe for person id, salary, department
df_salary = pd.DataFrame({'person id': [1,1, 2, 8, 9, 5], 'salary': [100000,12, 200000, 300000, 400000, 500000], 'department': ['HR','JY', 'IT', 'Finance', 'Marketing', 'Sales']})

In [ ]:
df_person.head()

   person id  name  age gender         city
0          1  John   25      M     New York
1          7  Jane   30      F  Los Angeles
2          3   Jim   35      M      Chicago
3          4  Jill   40      F      Houston
4          5  Jack   45      M        Miami

In [ ]:
df_salary

   person id  salary department
0          1  100000         HR
1          1      12         JY
2          2  200000         IT
3          8  300000    Finance
4          9  400000  Marketing
5          5  500000      Sales

In [ ]:
df_left_join = pd.merge(df_person, df_salary, on='person id', how='left')
df_left_join

   person id  name  age gender         city    salary department
0          1  John   25      M     New York  100000.0         HR
1          1  John   25      M     New York      12.0         JY
2          7  Jane   30      F  Los Angeles       NaN        NaN
3          3   Jim   35      M      Chicago       NaN        NaN
4          4  Jill   40      F      Houston       NaN        NaN
5          5  Jack   45      M        Miami  500000.0      Sales

In [ ]:
df_inner_join = pd.merge(df_person, df_salary, on='person id', how='inner')
df_inner_join

   person id  name  age gender      city  salary department
0          1  John   25      M  New York  100000         HR
1          1  John   25      M  New York      12         JY
2          5  Jack   45      M     Miami  500000      Sales

In [ ]:
# merge the two dataframes on the person id column
df_merged = pd.merge(df_person, df_salary, on='person id')

# display the merged dataframe
df_merged

   key  rval
0  foo     4
1  foo     5

In [ ]:
(left_table, right_table, on='key',how='left')

In [ ]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### append

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

df

          A         B         C         D
0  0.011434  0.561576 -0.404883 -0.379071
1  0.219870 -0.262600  1.655387 -1.337430
2  0.049214  0.755147 -0.627302  0.222629
3  0.473009 -0.855307  0.353166 -0.914310
4 -0.514169  0.412218  0.982430  0.125486
5  0.517962 -0.516783 -1.503420 -0.822614
6  0.669895 -0.772236  1.306589 -1.052182
7 -0.698510 -0.473854 -0.716590  0.728072

In [ ]:
s = df.iloc[3]

df.append(s, ignore_index=True)

          A         B         C         D
0  0.011434  0.561576 -0.404883 -0.379071
1  0.219870 -0.262600  1.655387 -1.337430
2  0.049214  0.755147 -0.627302  0.222629
3  0.473009 -0.855307  0.353166 -0.914310
4 -0.514169  0.412218  0.982430  0.125486
5  0.517962 -0.516783 -1.503420 -0.822614
6  0.669895 -0.772236  1.306589 -1.052182
7 -0.698510 -0.473854 -0.716590  0.728072
8  0.473009 -0.855307  0.353166 -0.914310

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                          'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                          'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
   ....: 
        
df

     A      B         C         D
0  foo    one -1.041123  0.737415
1  bar    one  0.291852  0.013531
2  foo    two -1.224050  0.391930
3  bar  three  0.621681 -0.534412
4  foo    two  0.760493 -0.294558
5  bar    two  0.313155  2.205908
6  foo    one  0.868063  0.460429
7  foo  three -0.594629  0.504813

## Grouping

In [13]:
# create a dataframe with 5 rows and 3 columns
df = pd.DataFrame({
    'gender': ['M', 'F','M', 'F','F'],
    'age': [20, 20, 22, 22, 23],
    'height': [160, 165, 170, 175, 180],
    'Salary': [10.5, 20.3, 30.7, 40.2, 50.1]
})

In [14]:
df

  gender  age  height  Salary
0      M   20     160    10.5
1      F   20     165    20.3
2      M   22     170    30.7
3      F   22     175    40.2
4      F   23     180    50.1

In [ ]:
df.groupby('gender').mean()

# mean , sum ,max, min, count

              age      height     Salary
gender
F       21.666667  173.333333  36.866667
M       21.000000  165.000000  20.600000

In [16]:
df.groupby(['gender','age']).mean()

            height  Salary
gender age
F      20    165.0    20.3
       22    175.0    40.2
       23    180.0    50.1
M      20    160.0    10.5
       22    170.0    30.7

In [17]:
df.groupby('gender').agg({'age': 'mean', 'height': 'mean', 'Salary': 'max'})

              age      height  Salary
gender
F       21.666667  173.333333    50.1
M       21.000000  165.000000    30.7

## Time Series

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5Min', how='sum')

/opt/conda/envs/python2new/lib/python2.7/site-packages/ipykernel_launcher.py:5: FutureWarning: how in .resample() is deprecated
the new syntax is .resample(...).sum()
  """

2012-01-01    27271
Freq: 5T, dtype: int64

In [ ]:
ts

2012-01-01 00:00:00    371
2012-01-01 00:00:01    157
2012-01-01 00:00:02    344
2012-01-01 00:00:03    470
2012-01-01 00:00:04    486
2012-01-01 00:00:05    397
2012-01-01 00:00:06     46
2012-01-01 00:00:07     77
2012-01-01 00:00:08    390
2012-01-01 00:00:09      0
2012-01-01 00:00:10    208
2012-01-01 00:00:11    259
2012-01-01 00:00:12    364
2012-01-01 00:00:13    441
2012-01-01 00:00:14    290
                      ...
2012-01-01 00:01:25    164
2012-01-01 00:01:26    218
2012-01-01 00:01:27     91
2012-01-01 00:01:28    170
2012-01-01 00:01:29    427
2012-01-01 00:01:30    224
2012-01-01 00:01:31    130
2012-01-01 00:01:32    482
2012-01-01 00:01:33    375
2012-01-01 00:01:34    292
2012-01-01 00:01:35    114
2012-01-01 00:01:36    143
2012-01-01 00:01:37    448
2012-01-01 00:01:38    435
2012-01-01 00:01:39    471
Freq: S, Length: 100, dtype: int64

In [ ]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
 
ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06    0.947631
2012-03-07    0.067918
2012-03-08   -0.136712
2012-03-09   -1.338626
2012-03-10    0.187815
Freq: D, dtype: float64

In [ ]:
ts_utc = ts.tz_localize('UTC')

ts_utc

2012-03-06 00:00:00+00:00    0.947631
2012-03-07 00:00:00+00:00    0.067918
2012-03-08 00:00:00+00:00   -0.136712
2012-03-09 00:00:00+00:00   -1.338626
2012-03-10 00:00:00+00:00    0.187815
Freq: D, dtype: float64

In [ ]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.947631
2012-03-06 19:00:00-05:00    0.067918
2012-03-07 19:00:00-05:00   -0.136712
2012-03-08 19:00:00-05:00   -1.338626
2012-03-09 19:00:00-05:00    0.187815
Freq: D, dtype: float64

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

2012-01-31    1.394655
2012-02-29    0.062511
2012-03-31    0.457832
2012-04-30   -0.907441
2012-05-31   -1.054522
Freq: M, dtype: float64

In [ ]:
ps = ts.to_period()

ps

2012-01    1.394655
2012-02    0.062511
2012-03    0.457832
2012-04   -0.907441
2012-05   -1.054522
Freq: M, dtype: float64

In [ ]:
ps.to_timestamp()

2012-01-01    1.394655
2012-02-01    0.062511
2012-03-01    0.457832
2012-04-01   -0.907441
2012-05-01   -1.054522
Freq: MS, dtype: float64

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

ts = pd.Series(np.random.randn(len(prng)), prng)

ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

ts.head()

1990-03-01 09:00   -1.309780
1990-06-01 09:00    0.140386
1990-09-01 09:00    0.857485
1990-12-01 09:00    2.320029
1991-03-01 09:00   -1.019216
Freq: H, dtype: float64

## Categoricals

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [ ]:
df["grade"] = df["raw_grade"].astype("category")

df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [ ]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [ ]:
# df.sort removed
# df.sort("grade")

In [ ]:
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64